app/controllers/admin/clients_controller.rb

SELECT `clients`.* FROM `clients`
---
  def index
    @clients = Client.all

SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 52 LIMIT 1
---
  def show
    @client = Client.find(params[:id])

SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 52 LIMIT 1
---
  def edit
    @client = Client.find(params[:id])