app/controllers/clients_controller.rb

SELECT `clients`.* FROM `clients`
---
  def index
    @clients = Client.all

SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 52 LIMIT 1
---
  def show
    @client = Client.find(params[:id])

INSERT INTO `clients` (`cidade`, `conjugue_cpf`, `conjugue_email`, `conjugue_nome`, `conjugue_sexo`, `cpf`, `created_at`, `email`, `estado_civil`, `idade`, `nome`, `renda_familiar`, `sexo`, `telefone`, `updated_at`) VALUES ('oibioboib', '', '', '', 'f', '006.737.443-37', '2013-05-29 03:11:40', 'candidosg@gmail.com', 'solteiro', '18-25', 'Candido', '3', 'm', '(86)9933-5216', '2013-05-29 03:11:40')
---
  def create
    @client = Client.new(params[:client])
    if @client.save

SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 47 LIMIT 1
DELETE FROM `clients` WHERE `clients`.`id` = 47
---
  def destroy
    @client = Client.find(params[:id])
    @client.destroy